{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# %pip install -q pandas python-dotenv langchain-community langchain-openai langchain-neo4j sentence_transformers"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 1. Imports"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "import json\n",
    "import random\n",
    "import pandas as pd\n",
    "\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_openai import ChatOpenAI\n",
    "\n",
    "\n",
    "from langchain_community.llms import HuggingFaceHub\n",
    "\n",
    "# Load environment variables from a .env file\n",
    "load_dotenv()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 2. Import Dataset"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### We'll use a public dataset published by MANISH KUMAR on `Kaggle`, which contains data about professional profiles on LinkedIn: https://www.kaggle.com/datasets/manishkumar7432698/linkedinuserprofiles?select=LinkedIn+people+profiles+datasets.csv "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>timestamp</th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>city</th>\n",
       "      <th>country_code</th>\n",
       "      <th>region</th>\n",
       "      <th>current_company:company_id</th>\n",
       "      <th>current_company:name</th>\n",
       "      <th>position</th>\n",
       "      <th>following</th>\n",
       "      <th>...</th>\n",
       "      <th>people_also_viewed</th>\n",
       "      <th>educations_details</th>\n",
       "      <th>education</th>\n",
       "      <th>avatar</th>\n",
       "      <th>languages</th>\n",
       "      <th>certifications</th>\n",
       "      <th>recommendations</th>\n",
       "      <th>recommendations_count</th>\n",
       "      <th>volunteer_experience</th>\n",
       "      <th>сourses</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2023-01-10</td>\n",
       "      <td>catherinemcilkenny</td>\n",
       "      <td>Catherine Fitzpatrick (McIlkenny), B.A</td>\n",
       "      <td>Canada</td>\n",
       "      <td>CA</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Snr Business Analyst at Emploi et Développemen...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>[{\"profile_link\":\"https://ca.linkedin.com/in/l...</td>\n",
       "      <td>Queen's University Belfast</td>\n",
       "      <td>[{\"degree\":\"Bachelor of Arts (B.A.) Honours\",\"...</td>\n",
       "      <td>https://media.licdn.com/dms/image/C4E03AQEcz_j...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2022-12-17</td>\n",
       "      <td>margot-bon-51a04624</td>\n",
       "      <td>Margot Bon</td>\n",
       "      <td>The Randstad, Netherlands</td>\n",
       "      <td>NL</td>\n",
       "      <td>EU</td>\n",
       "      <td>gemeente-utrecht</td>\n",
       "      <td>Gemeente Utrecht</td>\n",
       "      <td>Communicatieadviseur Corporate &amp; Strategie Gem...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>[{\"profile_link\":\"https://nl.linkedin.com/in/j...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[{\"degree\":\"Scrum en Agile werken\",\"end_year\":...</td>\n",
       "      <td>https://static.licdn.com/sc/h/244xhbkr7g40x6bs...</td>\n",
       "      <td>[{\"subtitle\":\"Professional working proficiency...</td>\n",
       "      <td>[{\"meta\":\"Issued Jun 2013\",\"subtitle\":\"Van der...</td>\n",
       "      <td>Menno H. Poort “Ik werk al jaren prettig met M...</td>\n",
       "      <td>2.0</td>\n",
       "      <td>[{\"cause\":\"\",\"duration\":\"Sep 2010 Jul 2020 9 y...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2023-05-17</td>\n",
       "      <td>mike-dean-8509a193</td>\n",
       "      <td>Mike Dean</td>\n",
       "      <td>England, United Kingdom</td>\n",
       "      <td>UK</td>\n",
       "      <td>NaN</td>\n",
       "      <td>network-rail</td>\n",
       "      <td>Network Rail</td>\n",
       "      <td>Network Data Manager at Network Rail</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>[{\"profile_link\":\"https://uk.linkedin.com/in/g...</td>\n",
       "      <td>Brighton Polytechnic</td>\n",
       "      <td>[{\"degree\":\"2:2\",\"end_year\":\"1991\",\"field\":\"El...</td>\n",
       "      <td>https://media.licdn.com/dms/image/C4D03AQHLj-Z...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2022-05-29</td>\n",
       "      <td>giovanna-panarella-99a0a4167</td>\n",
       "      <td>Giovanna Panarella</td>\n",
       "      <td>Avellino, Campania, Italy</td>\n",
       "      <td>IT</td>\n",
       "      <td>EU</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Freelance</td>\n",
       "      <td>Architetto (Freelance)</td>\n",
       "      <td>500.0</td>\n",
       "      <td>...</td>\n",
       "      <td>[{\"profile_link\":\"https://it.linkedin.com/in/e...</td>\n",
       "      <td>Università di Camerino</td>\n",
       "      <td>[{\"degree\":\"“Corso di aggiornamento profession...</td>\n",
       "      <td>https://media-exp1.licdn.com/dms/image/C4D03AQ...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[{\"cause\":\"Arts and Culture\",\"duration\":\"Jan 2...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2022-12-06</td>\n",
       "      <td>steve-latimer-3364327</td>\n",
       "      <td>Steve Latimer</td>\n",
       "      <td>Ontario, Canada</td>\n",
       "      <td>CA</td>\n",
       "      <td>NaN</td>\n",
       "      <td>mid-range-computer-group-inc.</td>\n",
       "      <td>Mid-Range Computer Group Inc.</td>\n",
       "      <td>Senior Account Executive at Mid-Range Computer...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>[{\"profile_link\":\"https://ca.linkedin.com/in/d...</td>\n",
       "      <td>St. Michael's College School</td>\n",
       "      <td>[{\"degree\":\"\",\"end_year\":\"1978\",\"field\":\"\",\"me...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[{\"meta\":\"Issued Jan 2022 See credential\",\"sub...</td>\n",
       "      <td>Blake Reeves “If I was a customer, I would wan...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 26 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    timestamp                            id  \\\n",
       "0  2023-01-10            catherinemcilkenny   \n",
       "1  2022-12-17           margot-bon-51a04624   \n",
       "2  2023-05-17            mike-dean-8509a193   \n",
       "3  2022-05-29  giovanna-panarella-99a0a4167   \n",
       "4  2022-12-06         steve-latimer-3364327   \n",
       "\n",
       "                                     name                       city  \\\n",
       "0  Catherine Fitzpatrick (McIlkenny), B.A                     Canada   \n",
       "1                              Margot Bon  The Randstad, Netherlands   \n",
       "2                               Mike Dean    England, United Kingdom   \n",
       "3                      Giovanna Panarella  Avellino, Campania, Italy   \n",
       "4                           Steve Latimer            Ontario, Canada   \n",
       "\n",
       "  country_code region     current_company:company_id  \\\n",
       "0           CA    NaN                            NaN   \n",
       "1           NL     EU               gemeente-utrecht   \n",
       "2           UK    NaN                   network-rail   \n",
       "3           IT     EU                            NaN   \n",
       "4           CA    NaN  mid-range-computer-group-inc.   \n",
       "\n",
       "            current_company:name  \\\n",
       "0                            NaN   \n",
       "1               Gemeente Utrecht   \n",
       "2                   Network Rail   \n",
       "3                      Freelance   \n",
       "4  Mid-Range Computer Group Inc.   \n",
       "\n",
       "                                            position  following  ...  \\\n",
       "0  Snr Business Analyst at Emploi et Développemen...        NaN  ...   \n",
       "1  Communicatieadviseur Corporate & Strategie Gem...        NaN  ...   \n",
       "2               Network Data Manager at Network Rail        NaN  ...   \n",
       "3                             Architetto (Freelance)      500.0  ...   \n",
       "4  Senior Account Executive at Mid-Range Computer...        NaN  ...   \n",
       "\n",
       "                                  people_also_viewed  \\\n",
       "0  [{\"profile_link\":\"https://ca.linkedin.com/in/l...   \n",
       "1  [{\"profile_link\":\"https://nl.linkedin.com/in/j...   \n",
       "2  [{\"profile_link\":\"https://uk.linkedin.com/in/g...   \n",
       "3  [{\"profile_link\":\"https://it.linkedin.com/in/e...   \n",
       "4  [{\"profile_link\":\"https://ca.linkedin.com/in/d...   \n",
       "\n",
       "             educations_details  \\\n",
       "0    Queen's University Belfast   \n",
       "1                           NaN   \n",
       "2          Brighton Polytechnic   \n",
       "3        Università di Camerino   \n",
       "4  St. Michael's College School   \n",
       "\n",
       "                                           education  \\\n",
       "0  [{\"degree\":\"Bachelor of Arts (B.A.) Honours\",\"...   \n",
       "1  [{\"degree\":\"Scrum en Agile werken\",\"end_year\":...   \n",
       "2  [{\"degree\":\"2:2\",\"end_year\":\"1991\",\"field\":\"El...   \n",
       "3  [{\"degree\":\"“Corso di aggiornamento profession...   \n",
       "4  [{\"degree\":\"\",\"end_year\":\"1978\",\"field\":\"\",\"me...   \n",
       "\n",
       "                                              avatar  \\\n",
       "0  https://media.licdn.com/dms/image/C4E03AQEcz_j...   \n",
       "1  https://static.licdn.com/sc/h/244xhbkr7g40x6bs...   \n",
       "2  https://media.licdn.com/dms/image/C4D03AQHLj-Z...   \n",
       "3  https://media-exp1.licdn.com/dms/image/C4D03AQ...   \n",
       "4                                                NaN   \n",
       "\n",
       "                                           languages  \\\n",
       "0                                                NaN   \n",
       "1  [{\"subtitle\":\"Professional working proficiency...   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                      certifications  \\\n",
       "0                                                NaN   \n",
       "1  [{\"meta\":\"Issued Jun 2013\",\"subtitle\":\"Van der...   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4  [{\"meta\":\"Issued Jan 2022 See credential\",\"sub...   \n",
       "\n",
       "                                     recommendations recommendations_count  \\\n",
       "0                                                NaN                   NaN   \n",
       "1  Menno H. Poort “Ik werk al jaren prettig met M...                   2.0   \n",
       "2                                                NaN                   NaN   \n",
       "3                                                NaN                   NaN   \n",
       "4  Blake Reeves “If I was a customer, I would wan...                   1.0   \n",
       "\n",
       "                                volunteer_experience сourses  \n",
       "0                                                NaN     NaN  \n",
       "1  [{\"cause\":\"\",\"duration\":\"Sep 2010 Jul 2020 9 y...     NaN  \n",
       "2                                                NaN     NaN  \n",
       "3  [{\"cause\":\"Arts and Culture\",\"duration\":\"Jan 2...     NaN  \n",
       "4                                                NaN     NaN  \n",
       "\n",
       "[5 rows x 26 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Read the LinkedIn people profiles dataset\n",
    "df = pd.read_csv('../data/raw/LinkedIn people profiles datasets.csv')\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We will clean the dataset to keep only the data we need for our knowledge graph:\n",
    "\n",
    "- **id**: unique identifier of the professional.\n",
    "- **name**: name of the professional.\n",
    "- **company**: name of the company where they work.\n",
    "- **education**: educational institution where they studied.\n",
    "- **languages**: languages they speak.\n",
    "- **industry**: main industry in which they have experience.\n",
    "- **country**: nationality of the worker.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>company</th>\n",
       "      <th>education</th>\n",
       "      <th>languages</th>\n",
       "      <th>industry</th>\n",
       "      <th>country</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>jessica-mccray-051b6bb6</td>\n",
       "      <td>Jessica McCray</td>\n",
       "      <td>Verizon Connect</td>\n",
       "      <td>Appalachian State University</td>\n",
       "      <td>English</td>\n",
       "      <td>Higher Education</td>\n",
       "      <td>United States</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>mohamed-ghiati-841871127</td>\n",
       "      <td>Mohamed Ghiati</td>\n",
       "      <td>Mercure Industrie</td>\n",
       "      <td>Ecole Marocaine des Sciences de l'ingénieur</td>\n",
       "      <td>Français|Arabe|Anglais</td>\n",
       "      <td>Hospitals and Health Care</td>\n",
       "      <td>Morocco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>sophia-ngadi-54346631</td>\n",
       "      <td>Sophia NGADI</td>\n",
       "      <td>African Reinsurance Brokers</td>\n",
       "      <td>Université Paris 1 Panthéon-Sorbonne</td>\n",
       "      <td>Francais|Anglais|Arabe|Italien</td>\n",
       "      <td>Hospitals and Health Care</td>\n",
       "      <td>Morocco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>adil-grini-303b74163</td>\n",
       "      <td>Adil Grini</td>\n",
       "      <td>Thenext.click</td>\n",
       "      <td>Ecole Nationale des Sciences Appliquées - Fès</td>\n",
       "      <td>Français|Anglais|Arabe</td>\n",
       "      <td>Hospitals and Health Care</td>\n",
       "      <td>Morocco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>duncanperry</td>\n",
       "      <td>Duncan Perry</td>\n",
       "      <td>North Star Executive Advisors</td>\n",
       "      <td>Cornell University - S.C. Johnson Graduate Sch...</td>\n",
       "      <td>French</td>\n",
       "      <td>North Star Executive Advisors</td>\n",
       "      <td>United States</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>986</th>\n",
       "      <td>nickrramos</td>\n",
       "      <td>Nick Ramos</td>\n",
       "      <td>Oracle</td>\n",
       "      <td>University of California, Los Angeles</td>\n",
       "      <td>English|Spanish</td>\n",
       "      <td>IT Services and IT Consulting</td>\n",
       "      <td>United States</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>989</th>\n",
       "      <td>mohamed-negm-796334a8</td>\n",
       "      <td>Mohamed Negm</td>\n",
       "      <td>ALDI Stores Australia</td>\n",
       "      <td>edX</td>\n",
       "      <td>English|Arabic|French</td>\n",
       "      <td>ALDI Stores Australia</td>\n",
       "      <td>Australia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>990</th>\n",
       "      <td>nagylagouveia</td>\n",
       "      <td>Nágyla Gouveia</td>\n",
       "      <td>Emilio Ribas</td>\n",
       "      <td>Universidade 7 de Setembro - UNI7</td>\n",
       "      <td>Inglês|Português</td>\n",
       "      <td>Emilio Ribas</td>\n",
       "      <td>Greater Fortaleza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>991</th>\n",
       "      <td>haris-nadeem</td>\n",
       "      <td>Haris Nadeem</td>\n",
       "      <td>JLL</td>\n",
       "      <td>University of South Florida</td>\n",
       "      <td>Urdu|English|Pashto|Punjabi</td>\n",
       "      <td>Real Estate</td>\n",
       "      <td>United States</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>993</th>\n",
       "      <td>mohamed-ibrahim-roushdy-cia-b95b067</td>\n",
       "      <td>Mohamed Ibrahim Roushdy , CIA</td>\n",
       "      <td>Abu Qir Petrolum</td>\n",
       "      <td>Institute of Internal Auditors IIA</td>\n",
       "      <td>English|Arabic</td>\n",
       "      <td>Oil and Gas</td>\n",
       "      <td>Egypt</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>205 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      id                           name  \\\n",
       "15               jessica-mccray-051b6bb6                 Jessica McCray   \n",
       "17              mohamed-ghiati-841871127                 Mohamed Ghiati   \n",
       "19                 sophia-ngadi-54346631                   Sophia NGADI   \n",
       "20                  adil-grini-303b74163                     Adil Grini   \n",
       "24                           duncanperry                   Duncan Perry   \n",
       "..                                   ...                            ...   \n",
       "986                           nickrramos                     Nick Ramos   \n",
       "989                mohamed-negm-796334a8                   Mohamed Negm   \n",
       "990                        nagylagouveia                 Nágyla Gouveia   \n",
       "991                         haris-nadeem                   Haris Nadeem   \n",
       "993  mohamed-ibrahim-roushdy-cia-b95b067  Mohamed Ibrahim Roushdy , CIA   \n",
       "\n",
       "                           company  \\\n",
       "15                 Verizon Connect   \n",
       "17               Mercure Industrie   \n",
       "19     African Reinsurance Brokers   \n",
       "20                   Thenext.click   \n",
       "24   North Star Executive Advisors   \n",
       "..                             ...   \n",
       "986                         Oracle   \n",
       "989          ALDI Stores Australia   \n",
       "990                   Emilio Ribas   \n",
       "991                            JLL   \n",
       "993               Abu Qir Petrolum   \n",
       "\n",
       "                                             education  \\\n",
       "15                        Appalachian State University   \n",
       "17         Ecole Marocaine des Sciences de l'ingénieur   \n",
       "19                Université Paris 1 Panthéon-Sorbonne   \n",
       "20       Ecole Nationale des Sciences Appliquées - Fès   \n",
       "24   Cornell University - S.C. Johnson Graduate Sch...   \n",
       "..                                                 ...   \n",
       "986              University of California, Los Angeles   \n",
       "989                                                edX   \n",
       "990                  Universidade 7 de Setembro - UNI7   \n",
       "991                        University of South Florida   \n",
       "993                 Institute of Internal Auditors IIA   \n",
       "\n",
       "                          languages                       industry  \\\n",
       "15                          English               Higher Education   \n",
       "17           Français|Arabe|Anglais      Hospitals and Health Care   \n",
       "19   Francais|Anglais|Arabe|Italien      Hospitals and Health Care   \n",
       "20           Français|Anglais|Arabe      Hospitals and Health Care   \n",
       "24                           French  North Star Executive Advisors   \n",
       "..                              ...                            ...   \n",
       "986                 English|Spanish  IT Services and IT Consulting   \n",
       "989           English|Arabic|French          ALDI Stores Australia   \n",
       "990                Inglês|Português                   Emilio Ribas   \n",
       "991     Urdu|English|Pashto|Punjabi                    Real Estate   \n",
       "993                  English|Arabic                    Oil and Gas   \n",
       "\n",
       "               country  \n",
       "15       United States  \n",
       "17             Morocco  \n",
       "19             Morocco  \n",
       "20             Morocco  \n",
       "24       United States  \n",
       "..                 ...  \n",
       "986      United States  \n",
       "989          Australia  \n",
       "990  Greater Fortaleza  \n",
       "991      United States  \n",
       "993              Egypt  \n",
       "\n",
       "[205 rows x 7 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# We will fill the empty data with this random values (just for demo purposes)\n",
    "industries = ['Advertising Services', 'IT Services and IT Consulting', 'Hospitals and Health Care', 'Higher Education', 'Retail', 'Financial Services', 'Telco', 'Media & Entertainment']\n",
    "countries= ['United States', 'Argentina', 'Spain', 'France', 'Mexico', 'United Kingdom', 'Sweden']\n",
    "\n",
    "# Function to extract the industry from the company information\n",
    "def extract_industry(json_str):\n",
    "    try:\n",
    "        data = json.loads(json_str)\n",
    "        return data.get('industry', random.choice(industries))\n",
    "    except json.JSONDecodeError:\n",
    "        return None\n",
    "\n",
    "# Function to extract the languages from the languages structure\n",
    "def extract_languages(json_list):\n",
    "    try:\n",
    "        languages = [entry['title'] for entry in json.loads(json_list)]\n",
    "        return '|'.join(languages)\n",
    "    except: \n",
    "        return None\n",
    "\n",
    "# Function to extract the country from the city structure\n",
    "def extract_country(string):\n",
    "    if isinstance(string, str):\n",
    "        elements = string.split(',')\n",
    "        return elements[-1].strip()  \n",
    "    else:\n",
    "        return random.choice(countries)\n",
    "\n",
    "# Extract the industry, languages and country information\n",
    "df['industry'] = df['current_company'].apply(lambda x: extract_industry(x))\n",
    "df['languages'] = df['languages'].apply(lambda x: extract_languages(x))\n",
    "df['country'] = df['city'].apply(lambda x: extract_country(x))\n",
    "\n",
    "# Remove the rows with empty values in these key columns (just for demo purposes)\n",
    "df = df [['id','name','current_company:name','educations_details','languages','industry','country']].dropna()\n",
    "\n",
    "# Rename some columns for better readability\n",
    "df = df.rename(columns={'current_company:name': 'company','educations_details':'education'})\n",
    "\n",
    "# Preview the curated data\n",
    "df.head(300)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# OPTIONAL: With this sentence you can save the curated csv in a new file called 'clean_data.csv'\n",
    "df.to_csv('../data/processed/clean_linkedin_data.csv', index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3 - Insert Data into Neo4J\n",
    "\n",
    "The first step is to prepare the connector to Neo4j using the `Neo4jGraph` utility from LangChain."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\aflon\\AppData\\Local\\Temp\\ipykernel_30300\\2095145302.py:9: LangChainDeprecationWarning: The class `Neo4jGraph` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-neo4j package and should be used instead. To use it run `pip install -U :class:`~langchain-neo4j` and import as `from :class:`~langchain_neo4j import Neo4jGraph``.\n",
      "  graph = Neo4jGraph(neo4j_url,neo4j_user,neo4j_password)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Person {name: STRING}\n",
      "Company {name: STRING}\n",
      "School {name: STRING}\n",
      "Industry {name: STRING}\n",
      "Country {name: STRING}\n",
      "Language {name: STRING}\n",
      "Chunk {embedding: LIST, id: STRING, text: STRING, question: STRING, query: STRING}\n",
      "ExampleNode {embedding: LIST, id: STRING, question: STRING, query: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Person)-[:SPEAKS]->(:Language)\n",
      "(:Person)-[:WORKS_IN]->(:Company)\n",
      "(:Person)-[:LIVES_IN]->(:Country)\n",
      "(:Person)-[:EDUCATED_AT]->(:School)\n",
      "(:Company)-[:IS_IN]->(:Industry)\n"
     ]
    }
   ],
   "source": [
    "from langchain_community.graphs import Neo4jGraph #DEPRACATED!!!!!!!!\n",
    "\n",
    "# Retrieve connection information to Neo4j from environment variables\n",
    "neo4j_url = os.getenv(\"NEO4J_URI\")\n",
    "neo4j_user = os.getenv(\"NEO4J_USER\")\n",
    "neo4j_password = os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "# https://api.python.langchain.com/en/latest/graphs/langchain_community.graphs.neo4j_graph.Neo4jGraph.html\n",
    "graph = Neo4jGraph(neo4j_url,neo4j_user,neo4j_password)\n",
    "\n",
    "graph.refresh_schema()\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We continue loading the previously prepared information into Neo4j using the LangChain utility."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# We set up the Cypher query to load the information from the csv that we have published on github\n",
    "people_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/jmunizwizeline/talent-land-2024/main/files/clean_data.csv'\n",
    "AS row\n",
    "MERGE (person:Person {name: row.name})\n",
    "MERGE (company:Company {name: row.company})\n",
    "MERGE (school:School {name: row.education})\n",
    "MERGE (industry:Industry {name: row.industry})\n",
    "MERGE (country:Country {name: row.country})\n",
    "\n",
    "FOREACH (lang in split(row.languages, '|') | \n",
    "    MERGE (language:Language {name:trim(lang)})\n",
    "    MERGE (person)-[:SPEAKS]->(language))\n",
    "\n",
    "MERGE (person)-[:WORKS_IN]->(company)\n",
    "MERGE (person)-[:LIVES_IN]->(country)\n",
    "MERGE (person)-[:EDUCATED_AT]->(school)\n",
    "MERGE (company)-[:IS_IN]->(industry)\n",
    "\"\"\"\n",
    "\n",
    "graph.query(people_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Finally, we confirm that the schema in the database has been modified and explore the relationships it has created for us."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Person {name: STRING}\n",
      "Company {name: STRING}\n",
      "School {name: STRING}\n",
      "Industry {name: STRING}\n",
      "Country {name: STRING}\n",
      "Language {name: STRING}\n",
      "Chunk {embedding: LIST, id: STRING, text: STRING, question: STRING, query: STRING}\n",
      "ExampleNode {embedding: LIST, id: STRING, question: STRING, query: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Person)-[:SPEAKS]->(:Language)\n",
      "(:Person)-[:WORKS_IN]->(:Company)\n",
      "(:Person)-[:LIVES_IN]->(:Country)\n",
      "(:Person)-[:EDUCATED_AT]->(:School)\n",
      "(:Company)-[:IS_IN]->(:Industry)\n"
     ]
    }
   ],
   "source": [
    "# We confirm that the schematic has been loaded\n",
    "graph.refresh_schema()\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 4 - Perform Our First Query on Our Knowledge Graph\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatOpenAI(\n",
    "    model=\"gpt-4o-mini\",\n",
    "    temperature=0,\n",
    "    max_tokens=None,\n",
    "    timeout=None,\n",
    "    max_retries=2\n",
    ")\n",
    "\n",
    "# We create the chain with the graph and the LLM\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    graph=graph,\n",
    "    llm=llm,\n",
    "    verbose=True,\n",
    "    allow_dangerous_requests=True  # This is to allow the chain to execute any query\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Company)-[:IS_IN]->(i:Industry {name: 'Advertising Services'})\n",
      "RETURN c.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Toolbox Creative'}, {'c.name': 'Sirabi Joukakelian Zoboyan, PPCC'}, {'c.name': 'CURTI Costruzioni Meccaniche Spa - Aerospace and Meccatronic'}, {'c.name': 'SAP'}, {'c.name': 'Baked Advertising'}, {'c.name': 'Nevo Medical'}, {'c.name': 'SMB Capital'}, {'c.name': 'Zaldivar Child Consultant Agency'}, {'c.name': 'Studiovarustamo Oy'}, {'c.name': 'Search Engine People'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The companies in the Advertising Services industry are Baked Advertising and Search Engine People.\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Person)-[:EDUCATED_AT]->(s:School {name: \"Simon Fraser University\"})\n",
      "RETURN p.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Damoon Tahmasbi'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The worker who graduated from Simon Fraser University is Damoon Tahmasbi.\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Person {name: 'Paul Lukes'})-[:WORKS_IN]->(c:Company)\n",
      "RETURN c.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Toolbox Creative'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Paul Lukes is working at Toolbox Creative.\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Person)-[:LIVES_IN]->(c:Country {name: \"Canada\"}), (p)-[:SPEAKS]->(l:Language {name: \"Vietnamese\"})\n",
      "RETURN p\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p': {'name': 'Vitaly Nhuien'}}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Vitaly Nhuien is a worker residing in Canada who is proficient in Vietnamese.\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Person)-[:SPEAKS]->(l:Language), (p)-[:LIVES_IN]->(c:Country)\n",
      "WHERE c.name = 'United States' AND l.name = 'Urdu'\n",
      "RETURN COUNT(p) AS numberOfWorkers\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'numberOfWorkers': 2}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Person)-[:WORKS_IN]->(c:Company {name: 'Capgemini'})\n",
      "RETURN COUNT(p) AS numberOfWorkers\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'numberOfWorkers': 2}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Capgemini has 2 workers.\n",
      "====== END ====== \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# List of questions that we want to run against the Knowledge Graph\n",
    "questions = [\"List all companies in Advertising Services industry!\",\n",
    "             \"A worker who graduated from Simon Fraser University what is his name?\",\n",
    "             \"Where is Paul Lukes working?\",\n",
    "             \"A worker residing in Canada who is proficient in Vietnamese?\",\n",
    "             \"How many workers from the United States speak Urdu?\",\n",
    "             \"How many workers work for Capgemini?\"]\n",
    "for q in questions:\n",
    "    print('====== START ======')\n",
    "    print(chain.invoke(q)['result'])\n",
    "    print('====== END ====== \\n')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 5 - Enhancing Prompting Strategy Using Role Prompting and Few-Shot Learning\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# We define some examples to show the model more details of the domain's structure\n",
    "examples= [\n",
    "    {\n",
    "        \"question\": \"Which workers speak French?\",\n",
    "        \"query\": \"MATCH (p:Person)-[:SPEAKS]->(l:Language {{name: 'French'}}) RETURN p.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What industries are workers named Emily associated with?\",\n",
    "        \"query\": \"MATCH (p:Person {{name: 'Emily'}})-[:WORKS_IN]->(c:Company)-[:IS_IN]->(i:Industry) RETURN i.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Which workers live in Canada and speak German?\",\n",
    "        \"query\": \"MATCH (p:Person)-[:LIVES_IN]->(:Country {{name: 'Canada'}}), (p)-[:SPEAKS]->(:Language {{name: 'German'}}) RETURN p.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"In which countries do workers who speak Spanish live?\",\n",
    "        \"query\": \"MATCH (p:Person)-[:SPEAKS]->(:Language {{name: 'Spanish'}})<-[:SPEAKS]-(worker:Person)-[:LIVES_IN]->(c:Country) RETURN DISTINCT c.name AS Country\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What companies do workers named John work in?\",\n",
    "        \"query\": \"MATCH (p:Person {{name: 'John'}})-[:WORKS_IN]->(c:Company) RETURN c.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\":\"How many workers in Hospital and Health Care industry able to speak Korea\",\n",
    "        \"query\": \"MATCH (p:Person)-[:WORKS_IN]->(:Company)-[:IS_IN]->(:Industry {{name: 'Hospitals and Health Care'}}),(p)-[:SPEAKS]->(:Language {{name: 'Korean'}}) RETURN COUNT(DISTINCT p) AS NumberOfWorkers\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What companies are located in the technology industry?\",\n",
    "        \"query\": \"MATCH (c:Company)-[:IS_IN]->(:Industry {{name: 'Technology'}}) RETURN c.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Where do workers named Alice live?\",\n",
    "        \"query\": \"MATCH (p:Person {{name: 'Alice'}})-[:LIVES_IN]->(c:Country) RETURN c.name\",\n",
    "    },\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate\n",
    "\n",
    "# We use another Langchain utility to implement the few-shot and prompting improvements\n",
    "example_prompt = PromptTemplate.from_template(\n",
    "    \"User input: {question}\\nCypher query: {query}\"\n",
    ")\n",
    "prompt = FewShotPromptTemplate(\n",
    "    examples=examples[:3],\n",
    "    example_prompt=example_prompt,\n",
    "    prefix=\"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nHere is the schema information\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables=[\"question\", \"schema\"],\n",
    ")\n",
    "\n",
    "# We create a new connector with the new strategy that we have just created\n",
    "chain2 = GraphCypherQAChain.from_llm(graph=graph, llm=llm, cypher_prompt=prompt, verbose=True, allow_dangerous_requests=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n",
      "\n",
      "Here is the schema information\n",
      "foo.\n",
      "\n",
      "Below are a number of examples of questions and their corresponding Cypher queries.\n",
      "\n",
      "User input: Which workers speak French?\n",
      "Cypher query: MATCH (p:Person)-[:SPEAKS]->(l:Language {name: 'French'}) RETURN p.name\n",
      "\n",
      "User input: What industries are workers named Emily associated with?\n",
      "Cypher query: MATCH (p:Person {name: 'Emily'})-[:WORKS_IN]->(c:Company)-[:IS_IN]->(i:Industry) RETURN i.name\n",
      "\n",
      "User input: Which workers live in Canada and speak German?\n",
      "Cypher query: MATCH (p:Person)-[:LIVES_IN]->(:Country {name: 'Canada'}), (p)-[:SPEAKS]->(:Language {name: 'German'}) RETURN p.name\n",
      "\n",
      "User input: Where do Michael work?\n",
      "Cypher query: \n"
     ]
    }
   ],
   "source": [
    "# This is an example of the prompt that we will run when we make a question\n",
    "print(prompt.format(question=\"Where do Michael work?\", schema=\"foo\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (c:Company)-[:IS_IN]->(i:Industry {name: 'Advertising Services'}) RETURN c.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Toolbox Creative'}, {'c.name': 'Sirabi Joukakelian Zoboyan, PPCC'}, {'c.name': 'CURTI Costruzioni Meccaniche Spa - Aerospace and Meccatronic'}, {'c.name': 'SAP'}, {'c.name': 'Baked Advertising'}, {'c.name': 'Nevo Medical'}, {'c.name': 'SMB Capital'}, {'c.name': 'Zaldivar Child Consultant Agency'}, {'c.name': 'Studiovarustamo Oy'}, {'c.name': 'Search Engine People'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:EDUCATED_AT]->(:School {name: 'Simon Fraser University'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Damoon Tahmasbi'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person {name: 'Paul Lukes'})-[:WORKS_IN]->(c:Company) RETURN c.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Toolbox Creative'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:LIVES_IN]->(:Country {name: 'Canada'}), (p)-[:SPEAKS]->(:Language {name: 'Vietnamese'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Vitaly Nhuien'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:LIVES_IN]->(:Country {name: 'United States'}), (p)-[:SPEAKS]->(:Language {name: 'Urdu'}) RETURN COUNT(p)\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'COUNT(p)': 2}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:WORKS_IN]->(:Company {name: 'Capgemini'}) RETURN COUNT(p)\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'COUNT(p)': 2}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# We run again the questions with this new improved strategy\n",
    "questions = [\"List all companies in Advertising Services industry!\",\n",
    "             \"A worker who graduated from Simon Fraser University what is his name?\",\n",
    "             \"Where is Paul Lukes working?\",\n",
    "             \"A worker residing in Canada who is proficient in Vietnamese?\",\n",
    "             \"How many workers from the United States speak Urdu?\",\n",
    "             \"How many workers work for Capgemini?\"]\n",
    "for q in questions:\n",
    "    print('====== START ======')\n",
    "    chain2.invoke(q)\n",
    "    print('====== END ====== \\n')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 6 - Enhancing Example Quality Using Similarity Search"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\aflon\\AppData\\Local\\Temp\\ipykernel_30300\\3780382961.py:8: LangChainDeprecationWarning: Default values for HuggingFaceEmbeddings.model_name were deprecated in LangChain 0.2.16 and will be removed in 0.4.0. Explicitly pass a model_name to the HuggingFaceEmbeddings constructor instead.\n",
      "  HuggingFaceEmbeddings(),\n"
     ]
    }
   ],
   "source": [
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "from langchain_community.embeddings import HuggingFaceEmbeddings\n",
    "\n",
    "# We use yet another Langchain utility to \n",
    "example_selector = SemanticSimilarityExampleSelector.from_examples(\n",
    "    examples,\n",
    "    HuggingFaceEmbeddings(),\n",
    "    Neo4jVector,\n",
    "    url = neo4j_url,\n",
    "    username = neo4j_user,\n",
    "    password = neo4j_password,\n",
    "    k=4,\n",
    "    input_keys=[\"question\"],\n",
    ")\n",
    "\n",
    "# DEPRACATED!!!!!\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"\n",
    "\n",
    "from langchain_community.vectorstores.neo4j_vector import Neo4jVector\n",
    "from langchain.embeddings import HuggingFaceEmbeddings\n",
    "from langchain.docstore.document import Document\n",
    "\n",
    "docs = [\n",
    "    Document(\n",
    "        page_content=ex[\"question\"],\n",
    "        metadata={\"question\": ex[\"question\"], \"query\": ex[\"query\"]}\n",
    "    )\n",
    "    for ex in examples\n",
    "]\n",
    "\n",
    "\n",
    "# Initialize the embedding model\n",
    "embedding_model = HuggingFaceEmbeddings(model_name=\"sentence-transformers/all-MiniLM-L6-v2\")\n",
    "\n",
    "# Create the Neo4jVector instance\n",
    "vectorstore = Neo4jVector.from_documents(\n",
    "    docs,\n",
    "    embedding_model,\n",
    "    url=neo4j_url,\n",
    "    username=neo4j_user,\n",
    "    password=neo4j_password,\n",
    "    index_name=\"example_index\",\n",
    "    node_label=\"ExampleNode\",\n",
    "    embedding_node_property=\"embedding\",\n",
    "    text_node_property=\"question\",\n",
    ")\n",
    "\n",
    "# Create a SemanticSimilarityExampleSelector that selects examples based on the \"question\" key.\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "example_selector = SemanticSimilarityExampleSelector(\n",
    "    vectorstore=vectorstore,\n",
    "    k=4,\n",
    "    input_keys=[\"question\"],\n",
    ")\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'query': \"MATCH (p:Person {{name: 'Alice'}})-[:LIVES_IN]->(c:Country) RETURN c.name\",\n",
       "  'question': 'Where do workers named Alice live?'},\n",
       " {'query': \"MATCH (p:Person {{name: 'John'}})-[:WORKS_IN]->(c:Company) RETURN c.name\",\n",
       "  'question': 'What companies do workers named John work in?'},\n",
       " {'query': \"MATCH (p:Person)-[:LIVES_IN]->(:Country {{name: 'Canada'}}), (p)-[:SPEAKS]->(:Language {{name: 'German'}}) RETURN p.name\",\n",
       "  'question': 'Which workers live in Canada and speak German?'},\n",
       " {'query': \"MATCH (p:Person)-[:SPEAKS]->(:Language {{name: 'Spanish'}})<-[:SPEAKS]-(worker:Person)-[:LIVES_IN]->(c:Country) RETURN DISTINCT c.name AS Country\",\n",
       "  'question': 'In which countries do workers who speak Spanish live?'}]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Now we can see that the set of 3 examples that we have selected are better and also are sort\n",
    "example_selector.select_examples({\"question\": \"Where do Michael live?\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Use the example selector and get rid of the examples=examples[:3]\n",
    "dynamic_prompt = FewShotPromptTemplate(\n",
    "    example_selector=example_selector,\n",
    "    example_prompt=example_prompt,\n",
    "    prefix=\"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nHere is the schema information\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables=[\"question\", \"schema\"],\n",
    ")\n",
    "\n",
    "# We create a new connector with the new strategy that we have just created\n",
    "chain3 = GraphCypherQAChain.from_llm(graph=graph, cypher_prompt=dynamic_prompt, llm=llm, verbose=True, top_k=32, return_intermediate_steps=True, allow_dangerous_requests=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (c:Company)-[:IS_IN]->(:Industry {name: 'Advertising Services'}) RETURN c.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Toolbox Creative'}, {'c.name': 'Sirabi Joukakelian Zoboyan, PPCC'}, {'c.name': 'CURTI Costruzioni Meccaniche Spa - Aerospace and Meccatronic'}, {'c.name': 'SAP'}, {'c.name': 'Baked Advertising'}, {'c.name': 'Nevo Medical'}, {'c.name': 'SMB Capital'}, {'c.name': 'Zaldivar Child Consultant Agency'}, {'c.name': 'Studiovarustamo Oy'}, {'c.name': 'Search Engine People'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:EDUCATED_AT]->(:School {name: 'Simon Fraser University'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Damoon Tahmasbi'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person {name: 'Paul Lukes'})-[:WORKS_IN]->(c:Company) RETURN c.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Toolbox Creative'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:LIVES_IN]->(:Country {name: 'Canada'}), (p)-[:SPEAKS]->(:Language {name: 'Vietnamese'}) RETURN p.name AS WorkerName\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'WorkerName': 'Vitaly Nhuien'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:LIVES_IN]->(:Country {name: 'United States'}), (p)-[:SPEAKS]->(:Language {name: 'Urdu'}) RETURN COUNT(DISTINCT p) AS NumberOfWorkers\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'NumberOfWorkers': 2}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Person)-[:WORKS_IN]->(:Company {name: 'Capgemini'}) RETURN COUNT(p) AS numberOfWorkers\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'numberOfWorkers': 2}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "====== END ====== \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# We run again the questions with this new improved strategy\n",
    "questions = questions = [\"List all companies in Advertising Services industry!\",\n",
    "             \"A worker who graduated from Simon Fraser University what is his name?\",\n",
    "             \"Where is Paul Lukes working?\",\n",
    "             \"A worker residing in Canada who is proficient in Vietnamese?\",\n",
    "             \"How many workers from the United States speak Urdu?\",\n",
    "             \"How many workers work for Capgemini?\"]\n",
    "\n",
    "for q in questions:\n",
    "    print('====== START ======')\n",
    "    chain3.invoke(q)\n",
    "    print('====== END ====== \\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
